app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      if !Artist.exists?(params[:artist_id])
        redirect_to artists_path, flash: {alert: 'Artist not fonun'}
      else
        @artist = Artist.find_by(id: params[:artist_id])
      end
      unless @song = @artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]

  def edit
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, flash: {alert: 'Artist not found'}
      else
        redirect_to artist_songs_path(@artist), flash: {alert: 'Song not found'} unless @song = @artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 2], ["id", 2]]